"========Переменные========"
# переменные - это ссылки на ячейку памяти, где хранятся какие-то данные, для дальнейшего использования этих данных

# num1 = 10
# num2 = 55
# num3 = 10
# print(num1 + num2 - num3)


"-------Правило наименования переменных-------"
# a = 5 # можно назвать, но назначение не понятно

# # 1num = 10 # нельзя называть переменные с числа

# my_name = "Makers" # нельзя использовать пробелы и символы кроме (_)

# print = "makers" # нельзя использовать встроенные названия функций, команд, операторов

# имя = "makers" # нельзя писать название кириллицей

# # Snake Case - python стиль наименования переменных
# my_namt = "makers"

# #Camel Case - стиль остальных языков програмирования
# myName = "makers"


"=======Ввод и вовод данных======="

# print - функция вывода данных в терминал
# input - функция ввода данных с терминала

# number = input('введите число: ')
# print(number)

"========Типы Данных======="
# Типы данных в питоне делятся на 2:
# изменяемые и не изменяемые

"Изменяемые"
# list
# set
# dict

"Неизменяемые"
# int, float, decimal, complex
# str
# tuple
# bool
# None
# frozenset

"=======Integer======="
# int - целые числа (15)
# float - числа с плавающей точкой (15.9)
# decimal - числа с плавающей точкой, но с большим диапозоном чисел после точки (15.2345345345)
# complex - числа из высшей математики (5j)

# num1 = "10" # "10" > 10
# num2 = 10
# print (int (num1) + 10)

# int () - переводит текст с числом в тип данных число

"=======Операции над числами========"
# 10 + 10 = 20 - сложение
# 10 - 10 = 0 - вычетание
# 10 * 10 = 100- умножение
# 10 / 5 = 2.0 - деление
# 10 // 5 = 2 - деление целочисленное
# 10 % 3 = 1 - остаток от деления
# 10 ** 2 = 100 - возведение в степень
