'===========GIT============'
#это распределенная система контроля версий (это системаб записывающая измнения в файл или набор файлов в течнии времени). предназначен для отслеживания и ведения исьории изменения файлов, в вашем проекте

'=============GITHUB==========='
#это сайт, куда я могу отправить все что находится на моем ноутбукеБ чтобы другие люди могли просмотривать мой код и мой прогресс, так же использовать код


'Репозиторий'
# хранилище проекта
# 1. локальный (на ноутбуке)
# 2. удаленный (на каком то сервисе, который представляет репозиторий (GITHUB))